Tekla Open API Reference for Tekla Structures 2025
View.ViewTypes Enumeration
 The possible types of views.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ViewTypes
Public Enumeration ViewTypes
Members
Member name | Value | Description
UnknownViewType | 0 |  The view type is not known.
FrontView | 1 |  Front side view of the part.
TopView | 2 |  Top side view of the part.
BackView | 3 |  Back side view of the part.
BottomView | 4 |  Bottom side view of the part.
EndView | 5 |  End side view of the part.
SectionView | 6 |  Section view of the part.
ModelView | 7 |  Model view of the part.
DetailView | 8 |  Detail view of the part.
_3DView | 9 |  3d view of the part.
See Also
Reference
Tekla.Structures.Drawing Namespace